examples/HuAngeli/c01/0/epsilon.cont
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.16;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
