examples/HuAngeli/c01/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices
(
	(-0.00335876 -0.00335876 0 ) //0
	(0.00335876 -0.00335876 0 ) //1
	(0.00335876 0.00335876 0 ) //2
	(-0.00335876 0.00335876 0 ) //3
	(-0.00335876 -0.00335876 3.2 ) //4
	(0.00335876 -0.00335876 3.2 ) //5
	(0.00335876 0.00335876 3.2 ) //6
	(-0.00335876 0.00335876 3.2 ) //7
	(0.013435 0.013435 0 ) //8
	(-0.013435 0.013435 0 ) //9
	(0.013435 0.013435 3.2 ) //10
	(-0.013435 0.013435 3.2 ) //11
	(-0.013435 -0.013435 0 ) //12
	(-0.013435 -0.013435 3.2 ) //13
	(0.013435 -0.013435 0 ) //14
	(0.013435 -0.013435 3.2 ) //15
);


edges
(
		arc 0 1 (0 -0.00389616 0)
		arc 1 2 (0.00389616 -8.7285e-11 0)
		arc 2 3 (0 0.00389616 0)
		arc 3 0 (-0.00389616 -8.7285e-11 0)
		arc 4 5 (0 -0.00389616 3.2)
		arc 5 6 (0.00389616 -8.7285e-11 3.2)
		arc 6 7 (0 0.00389616 3.2)
		arc 7 4 (-0.00389616 -8.7285e-11 3.2)
		arc 8 9 (-2.64272e-10 0.019 0)
		arc 10 11 (-2.64272e-10 0.019 3.2)
		arc 9 12 (-0.019 6.03944e-10 0)
		arc 11 13 (-0.019 6.03944e-10 3.2)
		arc 12 14 (-2.0384e-09 -0.019 0)
		arc 13 15 (-2.0384e-09 -0.019 3.2)
		arc 14 8 (0.019 -1.20789e-09 0)
		arc 15 10 (0.019 -1.20789e-09 3.2)
);

blocks
(
		hex (0 1 2 3 4 5 6 7 ) (9 9 250 ) simpleGrading (1 1 1 )
		hex (2 8 9 3 6 10 11 7 ) (16 9 250 ) simpleGrading (1 1 1 )
		hex (3 9 12 0 7 11 13 4 ) (16 9 250 ) simpleGrading (1 1 1 )
		hex (0 12 14 1 4 13 15 5 ) (16 9 250 ) simpleGrading (1 1 1 )
		hex (1 14 8 2 5 15 10 6 ) (16 9 250 ) simpleGrading (1 1 1 )
);

boundary
(
	walls
	{
	type wall;
	faces
	(
		(8 9 11 10)
		(9 12 13 11)
		(12 14 15 13)
		(14 8 10 15)
	);
	}

	outlet
	{
	type patch;
	faces
	(
		(4 5 6 7)
		(6 10 11 7)
		(7 11 13 4)
		(4 13 15 5)
		(5 15 10 6)
	);
	}

	inlet
	{
	type patch;
	faces
	(
		(0 1 2 3)
		(2 8 9 3)
		(3 9 12 0)
		(0 12 14 1)
		(1 14 8 2)
	);
	}

);

