examples/HuAngeli/c01/constant/thermophysicalProperties.disp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.cont;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   170;
    }
    thermodynamics
    {
    	//heat capacity
        Cp          2010;
        Hf          0;
    }
    transport
    {
        mu          5.5e-03;
	//Prandtl number at 30 celsius
        Pr          6.03;
    }
    equationOfState
    {
    	R	3000;
	rho0	828;
    }
}


// ************************************************************************* //
