examples/HuAngeli/c01/constant/turbulenceProperties.disp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    /*RASModel kEpsilon;*/
    RASModel	mixtureKEpsilon;

    turbulence      on;
    printCoeffs     on;

    /*kineticTheoryCoeffs*/
    /*{*/
        /*equilibrium             off;*/

        /*e                       0.8;*/
        /*alphaMax                0.62;*/
        /*alphaMinFriction        0.5;*/
        /*residualAlpha           1e-6;*/

        /*viscosityModel          Gidaspow;*/
        /*conductivityModel       Gidaspow;*/
        /*granularPressureModel   Lun;*/
        /*frictionalStressModel   JohnsonJackson;*/
        /*radialModel             SinclairJackson;*/

        /*JohnsonJacksonCoeffs*/
        /*{*/
            /*Fr                      0.05;*/
            /*eta                     2;*/
            /*p                       5;*/
            /*phi                     28.5;*/
        /*}*/
    /*}*/

    /*phasePressureCoeffs*/
    /*{*/
        /*preAlphaExp     500;*/
        /*expMax          1000;*/
        /*alphaMax        0.62;*/
        /*g0              1000;*/
    /*}*/
}


// ************************************************************************* //
